ЕРПУХАстенд.cbr_Основной/src/Documents/УсловияАгентскогоВознагражения/УсловияАгентскогоВознагражения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УсловияАгентскогоВознагражения</name>
  <comment>//++ БаженоваЕО 26.01.2026 ПР17</comment>
  <registerRecords>InformationRegister.УсловияАгентскогоВознаграждения</registerRecords>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПартнерКлиента</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.КоммерческоеПредложениеКлиенту</types>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Агенты</name>
    <attributes>
      <name>ПартнерАгент</name>
      <type>
        <types>CatalogRef.Партнеры</types>
      </type>
    </attributes>
    <attributes>
      <name>Агент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоговорАгента</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>БазоваяСтавка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаАгента</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Номенклатура</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Агент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаАгента</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ЕРПУХАстенд.cbr_Основной/src/InformationRegisters/БазовыеУсловияАгентскогоВознаграждения/БазовыеУсловияАгентскогоВознаграждения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>БазовыеУсловияАгентскогоВознаграждения</name>
  <comment>//++ БаженоваЕО 26.01.2026 ПР17</comment>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>БазоваяСтавка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Агент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДоговорАгента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаРеализации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ЕРПУХАстенд.cbr_Основной/src/InformationRegisters/УсловияАгентскогоВознаграждения/УсловияАгентскогоВознаграждения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УсловияАгентскогоВознаграждения</name>
  <comment>//++ БаженоваЕО 26.01.2026 ПР17</comment>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>БазоваяСтавкаОсновная</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтавкаАгентаОсновная</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтавкаАгента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДоговорАгента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.КоммерческоеПредложениеКлиенту</types>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Агент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДоговорКлиента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ЕРПУХАстенд.cbr_Основной/src/Enums/ТипыНоменклатуры/ТипыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="951a5403-e1a4-4484-8fda-c18df8f291d3">
  <name>ТипыНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="57507687-e857-4627-84a6-131b6dc5555a">
    <name>Товар</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="d257be95-baab-4cf8-b5ae-541216c91b07">
    <name>Услуга</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="898c017b-174f-4670-8146-5c6e75af51c1">
    <name>МногооборотнаяТара</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

ЕРПУХАстенд.cbr_Основной/src/Enums/СостоянияСогласования/СостоянияСогласования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="0fa4fd69-7e8f-4d18-9801-9fa74f7d2d1c">
  <name>СостоянияСогласования</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="c5228853-6ea7-4bea-a690-e6d6e91352fe">
    <name>Черновик</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

ЕРПУХАстенд.cbr_Основной/src/Documents/ЗаказКлиента/ЗаказКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="1ceef4a2-6b58-45a0-8a75-bb6e3004590f">
  <name>ЗаказКлиента</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>AccumulationRegister.cbr_ТоварыПоступлениеОтгрузкаБезУчастияВДоставке</registerRecords>
  <registerRecords>AccumulationRegister.cbr_ОстаткиНоменклатурыПоСоглашению</registerRecords>
  <attributes>
    <name>cbr_Проект</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>cbr_ТранспортныйТариф</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>cbr_СтоимостьДоставкиСНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>cbr_СтоимостьДоставки</name>
    <comment>//++ БаженоваЕО 22.01.2026 ПР17</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>cbr_СтоимостьДоставкиБезНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>cbr_ДокументыДляВодителя</name>
    <comment>//++АшаеваАН 29.01.26 ПРД.5</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>cbr_ТаможенноеСопровождение</name>
    <comment>//++АшаеваАН 29.01.26 ПРД.5</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>cbr_УсловияДоставки</name>
    <comment>//++АшаеваАН 29.01.26 ПРД.5</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>cbr_ТребованияКУпаковке</name>
    <comment>//++АшаеваАН 29.01.26 ПРД.5</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>cbr_ТребованияКЭтикетке</name>
    <comment>//++АшаеваАН 29.01.26 ПРД.5</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>cbr_ТребованиеККомплектации</name>
    <comment>//++АшаеваАН 29.01.26 ПРД.5</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>cbr_НеБолееДатыПроизводства</name>
    <comment>//++АшаеваАН 29.01.26 ПРД.5</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>cbr_ДопустимыйОстатокГСХНеМенееПроцент</name>
    <comment>//++АшаеваАН 29.01.26 ПРД.5</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>cbr_ДопустимыйОстатокГСХНеМенееМес</name>
    <comment>//++АшаеваАН 29.01.26 ПРД.5</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>cbr_ПрочиеТребования</name>
    <comment>//++АшаеваАН 29.01.26 ПРД.5</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>cbr_ПересечениеМенеджеров</name>
    <comment>//++ БаженоваЕО 27.01.2026 ПРД.18</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>cbr_АгентскоеВознаграждение</name>
    <comment>//++ Тусеев ПРД12</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="3c728d38-3039-41f6-b288-2b92f32630c3">
    <name>Соглашение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a8d06692-73f7-469f-a6a7-388a13d421d2">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>cbr_ТЧПересечениеМенеджеров</name>
    <comment>//++ БаженоваЕО 27.01.2026 ПРД.18</comment>
    <attributes>
      <name>ФизическоеЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Процент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="7b526229-3286-418a-920a-ff15a9b3ec48">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>cbr_ЦенаСоСкидкой</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>cbr_АгентскиеВознаграждения</name>
    <comment>//++ Тусеев ПРД12</comment>
    <attributes>
      <name>Агент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоговорАгента</name>
      <type>
        <types>DocumentRef.ВерсияСоглашенияКоммерческийДоговор</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаАВ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ЕРПУХАстенд.cbr_Основной/src/Documents/УсловияАгентскогоВознагражения/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если Не ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказКлиента") 
		И Не ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.КоммерческоеПредложениеКлиенту")
		Тогда
		
		Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
		КонецЕсли;
		
		Возврат;
		
	КонецЕсли;
	
	СтрокаРеквизитов = "Партнер, Контрагент, Организация, Договор";
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.КоммерческоеПредложениеКлиенту") Тогда
		СтрокаРеквизитов = "Контрагент, Организация, Контрагент.Партнер";
	КонецЕсли;
	РеквизитыОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеЗаполнения, СтрокаРеквизитов);
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, РеквизитыОснования);
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		ПартнерКлиента = РеквизитыОснования.Партнер;
	Иначе
		ПартнерКлиента = РеквизитыОснования.КонтрагентПартнер;
	КонецЕсли;
	Клиент = РеквизитыОснования.Контрагент;
	Основание = ДанныеЗаполнения;
	
	Если Не ЗначениеЗаполнено(Ответственный) Тогда
		Ответственный = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	БазовыеУсловияАгентскогоВознагражденияСрезПоследних.Агент КАК Агент,
		|	БазовыеУсловияАгентскогоВознагражденияСрезПоследних.ДоговорАгента КАК ДоговорАгента,
		|	БазовыеУсловияАгентскогоВознагражденияСрезПоследних.Агент.Партнер КАК ПартнерАгент,
		|	БазовыеУсловияАгентскогоВознагражденияСрезПоследних.БазоваяСтавка КАК БазоваяСтавка,
		|	БазовыеУсловияАгентскогоВознагражденияСрезПоследних.БазоваяСтавка КАК СтавкаАгента
		|ПОМЕСТИТЬ ВТ_Агенты
		|ИЗ
		|	РегистрСведений.БазовыеУсловияАгентскогоВознаграждения.СрезПоследних(
		|			&ДатаСреза,
		|			Организация = &Организация
		|				И Клиент = &Клиент
		|				И ДатаРеализации >= &ДатаСреза) КАК БазовыеУсловияАгентскогоВознагражденияСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Агенты.Агент КАК Агент,
		|	ВТ_Агенты.ДоговорАгента КАК ДоговорАгента,
		|	ВТ_Агенты.ПартнерАгент КАК ПартнерАгент,
		|	ВТ_Агенты.БазоваяСтавка КАК БазоваяСтавка,
		|	ВТ_Агенты.СтавкаАгента КАК СтавкаАгента
		|ИЗ
		|	ВТ_Агенты КАК ВТ_Агенты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
		|	ЗаказКлиентаТовары.Характеристика КАК Характеристика,
		|	ВТ_Агенты.Агент КАК Агент,
		|	ВТ_Агенты.СтавкаАгента КАК СтавкаАгента
		|ИЗ
		|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары,
		|	ВТ_Агенты КАК ВТ_Агенты
		|ГДЕ
		|	ЗаказКлиентаТовары.Ссылка = &Документ
		|	И НЕ ЗаказКлиентаТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
		|	И ТИПЗНАЧЕНИЯ(&Документ) = ТИП(Документ.ЗаказКлиента)
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказКлиентаТовары.Номенклатура,
		|	ЗаказКлиентаТовары.Характеристика,
		|	ВТ_Агенты.Агент,
		|	ВТ_Агенты.СтавкаАгента
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
		|	ЗаказКлиентаТовары.Характеристика КАК Характеристика,
		|	ВТ_Агенты.Агент КАК Агент,
		|	ВТ_Агенты.СтавкаАгента КАК СтавкаАгента
		|ИЗ
		|	Документ.КоммерческоеПредложениеКлиенту.Товары КАК ЗаказКлиентаТовары,
		|	ВТ_Агенты КАК ВТ_Агенты
		|ГДЕ
		|	ЗаказКлиентаТовары.Ссылка = &Документ
		|	И НЕ ЗаказКлиентаТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
		|	И ТИПЗНАЧЕНИЯ(&Документ) = ТИП(Документ.КоммерческоеПредложениеКлиенту)
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказКлиентаТовары.Номенклатура,
		|	ЗаказКлиентаТовары.Характеристика,
		|	ВТ_Агенты.Агент,
		|	ВТ_Агенты.СтавкаАгента
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	УсловияАгентскогоВознаграждения.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрСведений.УсловияАгентскогоВознаграждения КАК УсловияАгентскогоВознаграждения
		|ГДЕ
		|	УсловияАгентскогоВознаграждения.Основание = &Документ";
	
	Запрос.УстановитьПараметр("ДатаСреза", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("Клиент", Клиент);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Документ", ДанныеЗаполнения);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаУсловий = РезультатЗапроса[3].Выбрать();
	Если ВыборкаУсловий.Следующий() Тогда
		Возврат;
	КонецЕсли;
	
	Агенты.Очистить();
	Номенклатура.Очистить();
	
	ВыборкаАгентов = РезультатЗапроса[1].Выбрать();	
	Пока ВыборкаАгентов.Следующий() Цикл
		НоваяСтрока = Агенты.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаАгентов);		
	КонецЦикла;
	
	ВыборкаНоменклатуры = РезультатЗапроса[2].Выбрать();
	Пока ВыборкаНоменклатуры.Следующий() Цикл
		НоваяСтрока = Номенклатура.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаНоменклатуры);		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	СтатусСогласования = УправлениеПроцессамиСогласованияУХ.ВернутьСтатусОбъекта(
													Ссылка,
													ПредопределенноеЗначение("Перечисление.СостоянияСогласования.Черновик"));
													
	Если Не СтатусСогласования = ПредопределенноеЗначение("Перечисление.СостоянияСогласования.Утверждена") Тогда
		Возврат;
	КонецЕсли;
	
	ПроведениеДокументов.ОбработкаПроведенияДокумента(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)

	СтатусСогласования = УправлениеПроцессамиСогласованияУХ.ВернутьСтатусОбъекта(
													Ссылка,
													ПредопределенноеЗначение("Перечисление.СостоянияСогласования.Черновик"));
													
	Если СтатусСогласования = ПредопределенноеЗначение("Перечисление.СостоянияСогласования.Утверждена") Тогда
		Отказ = Истина;
		ТекстСообщения = НСтр("ru='Документ уже согласован. Отмена проведения невозможна!'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ПроведениеДокументов.ОбработкаУдаленияПроведенияДокумента(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПроведениеДокументов.ПередЗаписьюДокумента(ЭтотОбъект, РежимЗаписи, РежимПроведения);
	
КонецПроцедуры  

Процедура ПриЗаписи(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПроведениеДокументов.ПриЗаписиДокумента(ЭтотОбъект, Отказ);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
